app/controllers/ideas_controller.rb

SELECT * FROM `ideas` WHERE (`ideas`.`user_id` = 1) ORDER BY title, description
---
  def index
    @ideas = Idea.find_all_by_user_id current_user, :order => "title"

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
SELECT * FROM `notes` WHERE (`notes`.`idea_id` = '3') LIMIT 1
---
  def show
    @idea = Idea.find(params[:id])
    @notes = Note.find_all_by_idea_id(params[:id])

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
---
  def edit
    @idea = Idea.find(params[:id])

INSERT INTO `ideas` (`updated_at`, `title`, `description`, `user_id`, `created_at`) VALUES('2008-12-30 12:36:25', 'my new business idea', 'asdf', NULL, '2008-12-30 12:36:25')
---
  def create
    @idea = Idea.new(params[:idea])

    respond_to do |format|
      if @idea.save

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
UPDATE `ideas` SET `title` = 'This is my best idea ever', `description` = 'Basically some really cool stuff!', `updated_at` = '2008-12-30 14:22:17' WHERE `id` = 1
---
  def update
    @idea = Idea.find(params[:id])

    respond_to do |format|
      if @idea.update_attributes(params[:idea])

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
DELETE FROM `ideas` WHERE `id` = 1
---
  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy