app/controllers/notes_controller.rb

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 5)
---
  def find_parent_idea
    @idea ||= Idea.find(params[:idea_id])

SELECT * FROM `notes` WHERE (`notes`.`id` = 2)
---
  def edit
    @idea = Idea.find(params[:idea_id])
    @note = Note.find(params[:id])

INSERT INTO `notes` (`updated_at`, `title`, `text`, `idea_id`, `user_id`, `created_at`) VALUES('2008-12-30 15:07:06', 'Ok, what do you think about this?', 'Dramatically supply cutting-edge networks after efficient process improvements. Distinctively brand unique leadership skills via multimedia based testing procedures. Efficiently strategize customer directed technology with diverse paradigms. \r\n\r\nDramatically whiteboard covalent e-commerce and intuitive niches. Compellingly mesh world-class expertise whereas clicks-and-mortar ROI.', NULL, 1, '2008-12-30 15:07:06')
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save

SELECT * FROM `notes` WHERE (`notes`.`id` = 6)
UPDATE `notes` SET `text` = 'Why don\'t you get a job?!', `updated_at` = '2008-12-30 15:13:32' WHERE `id` = 6
---
  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])

SELECT * FROM `notes` WHERE (`notes`.`id` = 5)
DELETE FROM `notes` WHERE `id` = 5
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy